# GetInputPoints Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandler..::..GetInputPoints Method
StructuralConnectionHandler Class See Also
---
Returns a list of additional points defining certain connections.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IList<ConnectionInputPoint> GetInputPoints()
```

Visual Basic
---
```text
Public Function GetInputPoints As IList(Of ConnectionInputPoint)
```

Visual C++
---
```text
public:
IList<ConnectionInputPoint^>^ GetInputPoints()
```

# See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace